In [21]:
import pandas as pd
import numpy as np

# 시리즈 객체
s = pd.Series([0, 0.25, 0.5, 0.75, 1.0])
s

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [3]:
s.values

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [4]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
s[1]

0.25

In [6]:
s[1:4]

1    0.25
2    0.50
3    0.75
dtype: float64

In [7]:
s = pd.Series([0, 0.25, 0.5, 0.75, 1.0],
             index = ['a', 'b', 'c', 'd', 'e'])
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [8]:
s['c']

0.5

In [9]:
s[['c', 'd', 'e']]

c    0.50
d    0.75
e    1.00
dtype: float64

In [10]:
'b' in s

True

In [11]:
s.unique()

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [12]:
s.value_counts()

0.00    1
0.25    1
0.50    1
0.75    1
1.00    1
dtype: int64

In [13]:
s.isin([0.25, 0.75])

a    False
b     True
c    False
d     True
e    False
dtype: bool

In [15]:
pop_tuple = {
    '서울특별시' : 9720846,
    '부산광역시' : 3404423,
    '인천광역시' : 2947217,
    '대구광역시' : 2427954,
    '대전광역시' : 1471040,
    '광주광역시' : 1455048
}

population = pd.Series(pop_tuple)
population

서울특별시    9720846
부산광역시    3404423
인천광역시    2947217
대구광역시    2427954
대전광역시    1471040
광주광역시    1455048
dtype: int64

In [16]:
population['서울특별시']

9720846

In [17]:
population['서울특별시':'인천광역시']

서울특별시    9720846
부산광역시    3404423
인천광역시    2947217
dtype: int64

In [18]:
# dataframe 객체

pd.DataFrame([{'A':2, 'B':4, 'D':3}, {'A':4, 'B':5, 'C':7}])

   A  B    D    C
0  2  4  3.0  NaN
1  4  5  NaN  7.0

In [22]:
pd.DataFrame(np.random.rand(5,5),
            columns=['A', 'B', 'C', 'D', 'E'],
            index=[1,2,3,4,5])

          A         B         C         D         E
1  0.436635  0.156638  0.917784  0.942289  0.163716
2  0.026367  0.529279  0.656643  0.257986  0.957111
3  0.503961  0.595661  0.748027  0.467162  0.646169
4  0.799276  0.861409  0.963884  0.139288  0.826455
5  0.144339  0.068990  0.219371  0.974470  0.652469

In [23]:
male_tuple = {
    '서울특별시' : 4732275,
    '부산광역시' : 1668618,
    '인천광역시' : 1476813,
    '대구광역시' : 1198815,
    '대전광역시' : 734441,
    '광주광역시' : 120060
}

male = pd.Series(male_tuple)
male

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     120060
dtype: int64

In [24]:
female_tuple = {
    '서울특별시' : 4988571,
    '부산광역시' : 1735805,
    '인천광역시' : 1470404,
    '대구광역시' : 1229139,
    '대전광역시' : 736599,
    '광주광역시' : 734988
}

female = pd.Series(female_tuple)
female

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736599
광주광역시     734988
dtype: int64

In [25]:
korea_df = pd.DataFrame({'인구수' : population,
                        '남자인구수' : male,
                        '여자인구수' : female})
korea_df

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3404423  1668618  1735805
인천광역시  2947217  1476813  1470404
대구광역시  2427954  1198815  1229139
대전광역시  1471040   734441   736599
광주광역시  1455048   120060   734988

In [26]:
korea_df.index

Index(['서울특별시', '부산광역시', '인천광역시', '대구광역시', '대전광역시', '광주광역시'], dtype='object')

In [28]:
korea_df.columns

Index(['인구수', '남자인구수', '여자인구수'], dtype='object')

In [29]:
korea_df['여자인구수']

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736599
광주광역시     734988
Name: 여자인구수, dtype: int64

In [30]:
korea_df['서울특별시':'인천광역시']

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3404423  1668618  1735805
인천광역시  2947217  1476813  1470404

In [31]:
# 인덱스 객체

idx = pd.Index([2,4,6,8,10])
idx

Int64Index([2, 4, 6, 8, 10], dtype='int64')

In [32]:
idx[1]

4

In [33]:
idx[1:2:2]

Int64Index([4], dtype='int64')

In [35]:
print(idx)
print(idx.size)
print(idx.shape)
print(idx.ndim)
print(idx.dtype)

Int64Index([2, 4, 6, 8, 10], dtype='int64')
5
(5,)
1
int64

In [44]:
idx1 = pd.Index([1,2,4,6,8])
idx2 = pd.Index([2,4,5,6,7])
print(idx1.append(idx2))
print(idx1.difference(idx2))
print(idx1 - idx2)
print(idx1.intersection(idx2))
print(idx1 & idx2)
print(idx1.union(idx2))
print(idx1 | idx2)
print(idx1.delete(0))
print(idx1.drop(1))
print(idx1 ^ idx2)

Int64Index([1, 2, 4, 6, 8, 2, 4, 5, 6, 7], dtype='int64')
Int64Index([1, 8], dtype='int64')
Int64Index([-1, -2, -1, 0, 1], dtype='int64')
Int64Index([2, 4, 6], dtype='int64')
Int64Index([2, 4, 6], dtype='int64')
Int64Index([1, 2, 4, 5, 6, 7, 8], dtype='int64')
Int64Index([1, 2, 4, 5, 6, 7, 8], dtype='int64')
Int64Index([2, 4, 6, 8], dtype='int64')
Int64Index([2, 4, 6, 8], dtype='int64')
Int64Index([1, 5, 7, 8], dtype='int64')

/var/folders/kk/gz0w5z5x38sd0qkdjkqmn82r0000gn/T/ipykernel_15487/1493835244.py:7: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead.
  print(idx1 & idx2)
/var/folders/kk/gz0w5z5x38sd0qkdjkqmn82r0000gn/T/ipykernel_15487/1493835244.py:9: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  print(idx1 | idx2)
/var/folders/kk/gz0w5z5x38sd0qkdjkqmn82r0000gn/T/ipykernel_15487/1493835244.py:12: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead.
  print(idx1 ^ idx2)

In [46]:
# 인덱싱

s = pd.Series([0, 0.25, 0.5, 0.75, 1.0],
             index = ['a', 'b', 'c', 'd', 'e'])
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [47]:
s.keys()

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [49]:
list(s.items())

[('a', 0.0), ('b', 0.25), ('c', 0.5), ('d', 0.75), ('e', 1.0)]

In [51]:
s['f'] = 1.25
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
f    1.25
dtype: float64

In [52]:
s['a':'d']

a    0.00
b    0.25
c    0.50
d    0.75
dtype: float64

In [53]:
s[0:4]

a    0.00
b    0.25
c    0.50
d    0.75
dtype: float64

In [54]:
s[(s>0.4)&(s<0.8)]

c    0.50
d    0.75
dtype: float64

In [55]:
s[['a', 'c', 'e']]

a    0.0
c    0.5
e    1.0
dtype: float64

In [57]:
# series 인덱싱

s = pd.Series(['a', 'b', 'c', 'd', 'e'],
              index = [1,3,5,7,9])
s

1    a
3    b
5    c
7    d
9    e
dtype: object

In [58]:
s[1] # 내가 지정한

'a'

In [59]:
s[2:4]

5    c
7    d
dtype: object

In [60]:
s.iloc[1] # 정수값으로 접근

'b'

In [61]:
s.iloc[2:4]

5    c
7    d
dtype: object

In [62]:
s.reindex(range(10))

0    NaN
1      a
2    NaN
3      b
4    NaN
5      c
6    NaN
7      d
8    NaN
9      e
dtype: object

In [63]:
s.reindex(range(10), method='bfill') # 전의 값으로 채워줘 back fill

0    a
1    a
2    b
3    b
4    c
5    c
6    d
7    d
8    e
9    e
dtype: object

In [64]:
# dataframe 인덱싱

korea_df

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3404423  1668618  1735805
인천광역시  2947217  1476813  1470404
대구광역시  2427954  1198815  1229139
대전광역시  1471040   734441   736599
광주광역시  1455048   120060   734988

In [65]:
korea_df['남자인구수']

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     120060
Name: 남자인구수, dtype: int64

In [66]:
korea_df.남자인구수

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     120060
Name: 남자인구수, dtype: int64

In [68]:
korea_df.여자인구수

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736599
광주광역시     734988
Name: 여자인구수, dtype: int64

In [69]:
korea_df['남녀비율'] = (korea_df['남자인구수'] * 100 / korea_df['여자인구수'])

In [70]:
korea_df

           인구수    남자인구수    여자인구수        남녀비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907
대전광역시  1471040   734441   736599   99.707032
광주광역시  1455048   120060   734988   16.334961

In [71]:
korea_df.values

array([[9.72084600e+06, 4.73227500e+06, 4.98857100e+06, 9.48623363e+01],
       [3.40442300e+06, 1.66861800e+06, 1.73580500e+06, 9.61293463e+01],
       [2.94721700e+06, 1.47681300e+06, 1.47040400e+06, 1.00435867e+02],
       [2.42795400e+06, 1.19881500e+06, 1.22913900e+06, 9.75329072e+01],
       [1.47104000e+06, 7.34441000e+05, 7.36599000e+05, 9.97070319e+01],
       [1.45504800e+06, 1.20060000e+05, 7.34988000e+05, 1.63349606e+01]])

In [72]:
korea_df.T

,서울특별시,부산광역시,인천광역시,대구광역시,대전광역시,광주광역시
인구수,9.720846e+06,3.404423e+06,2.947217e+06,2.427954e+06,1.471040e+06,1.455048e+06
남자인구수,4.732275e+06,1.668618e+06,1.476813e+06,1.198815e+06,7.344410e+05,1.200600e+05
여자인구수,4.988571e+06,1.735805e+06,1.470404e+06,1.229139e+06,7.365990e+05,7.349880e+05
남녀비율,9.486234e+01,9.612935e+01,1.004359e+02,9.753291e+01,9.970703e+01,1.633496e+01

In [73]:
korea_df.values[0]

array([9.72084600e+06, 4.73227500e+06, 4.98857100e+06, 9.48623363e+01])

In [74]:
korea_df['인구수']

서울특별시    9720846
부산광역시    3404423
인천광역시    2947217
대구광역시    2427954
대전광역시    1471040
광주광역시    1455048
Name: 인구수, dtype: int64

In [75]:
korea_df.loc[:'인천광역시', :'남자인구수']

           인구수    남자인구수
서울특별시  9720846  4732275
부산광역시  3404423  1668618
인천광역시  2947217  1476813

In [76]:
korea_df.loc[(korea_df.여자인구수 > 1000000)]

           인구수    남자인구수    여자인구수        남녀비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907

In [77]:
korea_df.loc[(korea_df.인구수 < 2000000)]

           인구수   남자인구수   여자인구수       남녀비율
대전광역시  1471040  734441  736599  99.707032
광주광역시  1455048  120060  734988  16.334961

In [78]:
korea_df.loc[(korea_df.인구수 > 2500000)]

           인구수    남자인구수    여자인구수        남녀비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867

In [80]:
korea_df.loc[korea_df.남녀비율 > 100] # 남자가 더 많음

           인구수    남자인구수    여자인구수        남녀비율
인천광역시  2947217  1476813  1470404  100.435867

In [81]:
korea_df.loc[(korea_df.인구수 > 2500000) & (korea_df.남녀비율 > 100)]

           인구수    남자인구수    여자인구수        남녀비율
인천광역시  2947217  1476813  1470404  100.435867

In [82]:
korea_df.iloc[:3, :2]

           인구수    남자인구수
서울특별시  9720846  4732275
부산광역시  3404423  1668618
인천광역시  2947217  1476813

In [83]:
# 다중 인덱싱

korea_df

           인구수    남자인구수    여자인구수        남녀비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907
대전광역시  1471040   734441   736599   99.707032
광주광역시  1455048   120060   734988   16.334961

In [85]:
idx_tuples = [('서울특별시', 2010), ('서울특별시', 2020),
             ('부산광역시', 2010), ('부산광역시', 2020),
             ('인천광역시', 2010), ('인천광역시', 2020),
             ('대구광역시', 2010), ('대구광역시', 2020),
             ('대전광역시', 2010), ('대전광역시', 2020),
             ('광주광역시', 2010), ('광주광역시', 2020)]
idx_tuples

[('서울특별시', 2010),
 ('서울특별시', 2020),
 ('부산광역시', 2010),
 ('부산광역시', 2020),
 ('인천광역시', 2010),
 ('인천광역시', 2020),
 ('대구광역시', 2010),
 ('대구광역시', 2020),
 ('대전광역시', 2010),
 ('대전광역시', 2020),
 ('광주광역시', 2010),
 ('광주광역시', 2020)]

In [88]:
pop_tuples = [10312545, 9720846,
              2567910, 3404423,
             2758296, 2947217,
             2511676, 2427954,
             1503664, 1471040,
             1454636, 1455048]
population = pd.Series(pop_tuples, index=idx_tuples)
population

(서울특별시, 2010)    10312545
(서울특별시, 2020)     9720846
(부산광역시, 2010)     2567910
(부산광역시, 2020)     3404423
(인천광역시, 2010)     2758296
(인천광역시, 2020)     2947217
(대구광역시, 2010)     2511676
(대구광역시, 2020)     2427954
(대전광역시, 2010)     1503664
(대전광역시, 2020)     1471040
(광주광역시, 2010)     1454636
(광주광역시, 2020)     1455048
dtype: int64

In [89]:
midx = pd.MultiIndex.from_tuples(idx_tuples)
midx

MultiIndex([('서울특별시', 2010),
            ('서울특별시', 2020),
            ('부산광역시', 2010),
            ('부산광역시', 2020),
            ('인천광역시', 2010),
            ('인천광역시', 2020),
            ('대구광역시', 2010),
            ('대구광역시', 2020),
            ('대전광역시', 2010),
            ('대전광역시', 2020),
            ('광주광역시', 2010),
            ('광주광역시', 2020)],
           )

In [90]:
population = population.reindex(midx)
population

서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [91]:
population[:, 2010]

서울특별시    10312545
부산광역시     2567910
인천광역시     2758296
대구광역시     2511676
대전광역시     1503664
광주광역시     1454636
dtype: int64

In [92]:
population['대전광역시', :]

2010    1503664
2020    1471040
dtype: int64

In [93]:
korea_mdf = population.unstack() #데이터프레임으로 바뀜

In [94]:
korea_mdf

           2010     2020
광주광역시   1454636  1455048
대구광역시   2511676  2427954
대전광역시   1503664  1471040
부산광역시   2567910  3404423
서울특별시  10312545  9720846
인천광역시   2758296  2947217

In [95]:
korea_mdf.stack() # 다중인덱싱 구조로 변환

광주광역시  2010     1454636
       2020     1455048
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
부산광역시  2010     2567910
       2020     3404423
서울특별시  2010    10312545
       2020     9720846
인천광역시  2010     2758296
       2020     2947217
dtype: int64

In [96]:
male_tuple = [5111259, 4732275, 1773170, 1668618, 1390356, 1476813,
             1255245, 1198815, 753648, 734441, 721780, 720060]

In [97]:
male_tuple

[5111259,
 4732275,
 1773170,
 1668618,
 1390356,
 1476813,
 1255245,
 1198815,
 753648,
 734441,
 721780,
 720060]

In [100]:
korea_mdf = pd.DataFrame({'총인구수' : population,
                        '남자인구수' : male_tuple})
korea_mdf

                총인구수    남자인구수
서울특별시 2010  10312545  5111259
      2020   9720846  4732275
부산광역시 2010   2567910  1773170
      2020   3404423  1668618
인천광역시 2010   2758296  1390356
      2020   2947217  1476813
대구광역시 2010   2511676  1255245
      2020   2427954  1198815
대전광역시 2010   1503664   753648
      2020   1471040   734441
광주광역시 2010   1454636   721780
      2020   1455048   720060

In [101]:
female_tuples = [5201286, 4988571,
                1794740, 1735805,
                1367940, 1470404,
                1256431, 1229139,
                750016, 736599,
                732856, 734988]
female_tuples

[5201286,
 4988571,
 1794740,
 1735805,
 1367940,
 1470404,
 1256431,
 1229139,
 750016,
 736599,
 732856,
 734988]

In [102]:
korea_mdf = pd.DataFrame({'총인구수' : population,
                        '남자인구수' : male_tuple,
                         '여자인구수' : female_tuples})
korea_mdf

                총인구수    남자인구수    여자인구수
서울특별시 2010  10312545  5111259  5201286
      2020   9720846  4732275  4988571
부산광역시 2010   2567910  1773170  1794740
      2020   3404423  1668618  1735805
인천광역시 2010   2758296  1390356  1367940
      2020   2947217  1476813  1470404
대구광역시 2010   2511676  1255245  1256431
      2020   2427954  1198815  1229139
대전광역시 2010   1503664   753648   750016
      2020   1471040   734441   736599
광주광역시 2010   1454636   721780   732856
      2020   1455048   720060   734988

In [103]:
ratio = korea_mdf['남자인구수'] * 100 / korea_mdf['여자인구수']
ratio

서울특별시  2010     98.269140
       2020     94.862336
부산광역시  2010     98.798155
       2020     96.129346
인천광역시  2010    101.638668
       2020    100.435867
대구광역시  2010     99.905606
       2020     97.532907
대전광역시  2010    100.484256
       2020     99.707032
광주광역시  2010     98.488653
       2020     97.968946
dtype: float64

In [104]:
ratio.unstack()

             2010        2020
광주광역시   98.488653   97.968946
대구광역시   99.905606   97.532907
대전광역시  100.484256   99.707032
부산광역시   98.798155   96.129346
서울특별시   98.269140   94.862336
인천광역시  101.638668  100.435867

In [105]:
korea_mdf = pd.DataFrame({'총인구수' : population,
                        '남자인구수' : male_tuple,
                         '여자인구수' : female_tuples,
                         '남녀비율' :ratio})
korea_mdf

                총인구수    남자인구수    여자인구수        남녀비율
서울특별시 2010  10312545  5111259  5201286   98.269140
      2020   9720846  4732275  4988571   94.862336
부산광역시 2010   2567910  1773170  1794740   98.798155
      2020   3404423  1668618  1735805   96.129346
인천광역시 2010   2758296  1390356  1367940  101.638668
      2020   2947217  1476813  1470404  100.435867
대구광역시 2010   2511676  1255245  1256431   99.905606
      2020   2427954  1198815  1229139   97.532907
대전광역시 2010   1503664   753648   750016  100.484256
      2020   1471040   734441   736599   99.707032
광주광역시 2010   1454636   721780   732856   98.488653
      2020   1455048   720060   734988   97.968946

In [108]:
# 다중인덱스 생성

df = pd.DataFrame(np.random.rand(6,3),
                 index = [['a', 'a', 'b', 'b', 'c', 'c'], [1,2,1,2,1,2]],
                 columns = ['c1', 'c2', 'c3'])
df

           c1        c2        c3
a 1  0.218807  0.427620  0.409229
  2  0.151829  0.556294  0.218640
b 1  0.775262  0.721901  0.141973
  2  0.103445  0.867246  0.715293
c 1  0.838668  0.029509  0.869207
  2  0.723701  0.859051  0.549785

In [110]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b', 'c', 'c'], [1,2,1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [111]:
pd.MultiIndex.from_tuples([('a',1), ('a',2), ('b',1), ('b',2), ('c',1), ('c',2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [112]:
pd.MultiIndex.from_product([['a', 'b', 'c'], [1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [113]:
population.index.names = ['행정구역', '년도']

In [114]:
population

행정구역   년도
서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [117]:
idx = pd.MultiIndex.from_product([['a', 'b', 'c'], [1,2]],
                                names = ['name1', 'name2'])
cols = pd.MultiIndex.from_product([['c1', 'c2', 'c3'], [1,2]],
                                names = ['col_name1', 'col_name2'])
data = np.round(np.random.randn(6,6), 2)
mdf = pd.DataFrame(data, index=idx, columns=cols)
mdf

col_name1      c1          c2          c3
col_name2       1     2     1     2     1     2
name1 name2
a     1      0.85 -1.99 -2.10 -0.04  0.59  1.23
      2     -0.14  0.60 -0.60 -0.37 -0.38  0.89
b     1     -1.52  0.49  0.32 -0.50 -0.46  0.07
      2     -1.07 -0.24  1.16 -0.72 -0.01 -0.61
c     1     -1.61 -1.92  1.36 -0.33 -0.13 -0.87
      2      0.83 -0.07 -0.13  1.22 -0.19  0.45

In [118]:
# 데이터 결합

s1 = pd.Series(['a', 'b'], index = [1,2])
s2 = pd.Series(['c', 'd'], index = [3,4])
pd.concat([s1,s2])

1    a
2    b
3    c
4    d
dtype: object

In [120]:
def create_df(cols, idx):
    data = {c: [str(c.lower()) + str(i) for i in idx] for c in cols}
    return pd.DataFrame(data,idx)

In [121]:
df1 = create_df('AB', [1,2])
df1

    A   B
1  a1  b1
2  a2  b2

In [122]:
df2 = create_df('AB', [3,4])
df2

    A   B
3  a3  b3
4  a4  b4

In [123]:
pd.concat([df1, df2])

    A   B
1  a1  b1
2  a2  b2
3  a3  b3
4  a4  b4

In [124]:
df3 = create_df('AB', [0,1])
df3

    A   B
0  a0  b0
1  a1  b1

In [125]:
df4 = create_df('CD', [0,1])
df4

    C   D
0  c0  d0
1  c1  d1

In [126]:
pd.concat([df3, df4])

     A    B    C    D
0   a0   b0  NaN  NaN
1   a1   b1  NaN  NaN
0  NaN  NaN   c0   d0
1  NaN  NaN   c1   d1

In [128]:
pd.concat([df1, df3], verify_integrity=True)

ValueError: Indexes have overlapping values: Int64Index([1], dtype='int64')

In [129]:
pd.concat([df1, df3], ignore_index=True)

    A   B
0  a1  b1
1  a2  b2
2  a0  b0
3  a1  b1

In [130]:
pd.concat([df1, df3], keys = ['X', 'Y'])

      A   B
X 1  a1  b1
  2  a2  b2
Y 0  a0  b0
  1  a1  b1

In [131]:
df5 = create_df('ABC', [1,2])
df6 = create_df('BCD', [3,4])
pd.concat([df5, df6])

     A   B   C    D
1   a1  b1  c1  NaN
2   a2  b2  c2  NaN
3  NaN  b3  c3   d3
4  NaN  b4  c4   d4

In [132]:
pd.concat([df5, df6], join = 'inner')

    B   C
1  b1  c1
2  b2  c2
3  b3  c3
4  b4  c4

In [133]:
df5.append(df6)

/var/folders/kk/gz0w5z5x38sd0qkdjkqmn82r0000gn/T/ipykernel_15487/551904218.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df5.append(df6)

     A   B   C    D
1   a1  b1  c1  NaN
2   a2  b2  c2  NaN
3  NaN  b3  c3   d3
4  NaN  b4  c4   d4

In [134]:
# 병합과 조인

df1 = pd.DataFrame({'학생' : ['홍길동', '이순신', '임꺽정', '김유신'],
                   '학과' : ['경영학과', '교육학과', '컴퓨터학과', '통계학과']})
df1

    학생     학과
0  홍길동   경영학과
1  이순신   교육학과
2  임꺽정  컴퓨터학과
3  김유신   통계학과

In [135]:
df2 = pd.DataFrame({'학생' : ['홍길동', '이순신', '임꺽정', '김유신'],
                   '입학년도' : [2012, 2016, 2019, 2020]})
df2

    학생  입학년도
0  홍길동  2012
1  이순신  2016
2  임꺽정  2019
3  김유신  2020

In [136]:
df3 = pd.merge(df1, df2)
df3

    학생     학과  입학년도
0  홍길동   경영학과  2012
1  이순신   교육학과  2016
2  임꺽정  컴퓨터학과  2019
3  김유신   통계학과  2020

In [138]:
df4 = pd.DataFrame({'학과' : ['경영학과', '교육학과', '컴퓨터학과', '통계학과'],
                   '학과장' : ['황희', '장영실', '안창호', '정약용']})
df4

      학과  학과장
0   경영학과   황희
1   교육학과  장영실
2  컴퓨터학과  안창호
3   통계학과  정약용

In [139]:
pd.merge(df3, df4)

    학생     학과  입학년도  학과장
0  홍길동   경영학과  2012   황희
1  이순신   교육학과  2016  장영실
2  임꺽정  컴퓨터학과  2019  안창호
3  김유신   통계학과  2020  정약용

In [140]:
df5 = pd.DataFrame({'학과': ['경영학과', '교육학과', '교육학과', '컴퓨터학과', '컴퓨터학과', '통계학과'],
                   '과목' : ['경영개론', '기초수학', '물리학', '프로그래밍', '운영체제', '확률론']})
df5

      학과     과목
0   경영학과   경영개론
1   교육학과   기초수학
2   교육학과    물리학
3  컴퓨터학과  프로그래밍
4  컴퓨터학과   운영체제
5   통계학과    확률론

In [141]:
pd.merge(df1, df5)

    학생     학과     과목
0  홍길동   경영학과   경영개론
1  이순신   교육학과   기초수학
2  이순신   교육학과    물리학
3  임꺽정  컴퓨터학과  프로그래밍
4  임꺽정  컴퓨터학과   운영체제
5  김유신   통계학과    확률론

In [142]:
pd.merge(df1, df2, on = '학생')

    학생     학과  입학년도
0  홍길동   경영학과  2012
1  이순신   교육학과  2016
2  임꺽정  컴퓨터학과  2019
3  김유신   통계학과  2020

In [143]:
df6 = pd.DataFrame({'이름' : ['홍길동', '이순신', '임꺽정', '김유신'],
                   '성적' : ['A', 'A+', 'B', 'A+']})
df6

    이름  성적
0  홍길동   A
1  이순신  A+
2  임꺽정   B
3  김유신  A+

In [145]:
pd.merge(df1, df6, left_on = '학생', right_on = '이름')

    학생     학과   이름  성적
0  홍길동   경영학과  홍길동   A
1  이순신   교육학과  이순신  A+
2  임꺽정  컴퓨터학과  임꺽정   B
3  김유신   통계학과  김유신  A+

In [148]:
pd.merge(df1, df6, left_on = '학생', right_on = '이름').drop("이름", axis=1)

    학생     학과  성적
0  홍길동   경영학과   A
1  이순신   교육학과  A+
2  임꺽정  컴퓨터학과   B
3  김유신   통계학과  A+

In [149]:
mdf1 = df1.set_index("학생")
mdf2 = df2.set_index("학생")

In [150]:
mdf1

        학과
학생
홍길동   경영학과
이순신   교육학과
임꺽정  컴퓨터학과
김유신   통계학과

In [151]:
mdf2

     입학년도
학생
홍길동  2012
이순신  2016
임꺽정  2019
김유신  2020

In [153]:
pd.merge(mdf1, mdf2, left_index=True, right_index=True)

        학과  입학년도
학생
홍길동   경영학과  2012
이순신   교육학과  2016
임꺽정  컴퓨터학과  2019
김유신   통계학과  2020

In [154]:
mdf1.join(mdf2)

        학과  입학년도
학생
홍길동   경영학과  2012
이순신   교육학과  2016
임꺽정  컴퓨터학과  2019
김유신   통계학과  2020

In [155]:
pd.merge(mdf1, df6, left_index=True, right_on='이름')

      학과   이름  성적
0   경영학과  홍길동   A
1   교육학과  이순신  A+
2  컴퓨터학과  임꺽정   B
3   통계학과  김유신  A+

In [156]:
df7 = pd.DataFrame({'이름' : ['홍길동', '이순신', '임꺽정'],
                   '주문음식' : ['햄버거', '피자', '짜장면']})
df7

    이름 주문음식
0  홍길동  햄버거
1  이순신   피자
2  임꺽정  짜장면

In [157]:
df8 = pd.DataFrame({'이름' : ['홍길동', '이순신', '김유신'],
                   '주문음료' : ['콜라', '사이다', '커피']})
df8

    이름 주문음료
0  홍길동   콜라
1  이순신  사이다
2  김유신   커피

In [158]:
pd.merge(df7, df8)

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다

In [159]:
pd.merge(df7, df8, how = 'inner')

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다

In [160]:
pd.merge(df7, df8, how = 'outer')

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다
2  임꺽정  짜장면  NaN
3  김유신  NaN   커피

In [161]:
pd.merge(df7, df8, how = 'left')

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다
2  임꺽정  짜장면  NaN

In [162]:
pd.merge(df7, df8, how = 'right')

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다
2  김유신  NaN   커피

In [163]:
df9 = pd.DataFrame({'이름' : ['홍길동', '이순신', '임꺽정', '김유신'],
                   '순위' : [3,2,4,1]})
df9

    이름  순위
0  홍길동   3
1  이순신   2
2  임꺽정   4
3  김유신   1

In [164]:
df10 = pd.DataFrame({'이름' : ['홍길동', '이순신', '임꺽정', '김유신'],
                   '순위' : [4,1,3,2]})
df10

    이름  순위
0  홍길동   4
1  이순신   1
2  임꺽정   3
3  김유신   2

In [165]:
pd.merge(df9, df10, on = '이름')

    이름  순위_x  순위_y
0  홍길동     3     4
1  이순신     2     1
2  임꺽정     4     3
3  김유신     1     2

In [166]:
pd.merge(df9, df10, on='이름', suffixes=["_인기", "_성적"])

    이름  순위_인기  순위_성적
0  홍길동      3      4
1  이순신      2      1
2  임꺽정      4      3
3  김유신      1      2

In [169]:
# 데이터 집계와 그룹 연산

df = pd.DataFrame({'c1' : ['a', 'a', 'b', 'b', 'c', 'd', 'b'],
                   'c2' : ['A', 'B', 'B', 'A', 'D', 'C', 'C'],
                   'c3' : np.random.randint(7),
                   'c4' : np.random.random(7)})

In [170]:
df

  c1 c2  c3        c4
0  a  A   5  0.255368
1  a  B   5  0.511193
2  b  B   5  0.449887
3  b  A   5  0.186916
4  c  D   5  0.848987
5  d  C   5  0.235228
6  b  C   5  0.099186

In [172]:
df.dtypes

c1     object
c2     object
c3      int64
c4    float64
dtype: object

In [176]:
df['c3'].groupby(df['c1']).mean()

c1
a    5.0
b    5.0
c    5.0
d    5.0
Name: c3, dtype: float64

In [177]:
df['c4'].groupby(df['c2']).std()

c2
A    0.048403
B    0.043350
C    0.096196
D         NaN
Name: c4, dtype: float64

In [178]:
df['c4'].groupby([df['c1'], df['c2']]).mean()

c1  c2
a   A     0.255368
    B     0.511193
b   A     0.186916
    B     0.449887
    C     0.099186
c   D     0.848987
d   C     0.235228
Name: c4, dtype: float64

In [179]:
df['c4'].groupby([df['c1'], df['c2']]).mean().unstack() # 데이터프레임 형태로

c2         A         B         C         D
c1
a   0.255368  0.511193       NaN       NaN
b   0.186916  0.449887  0.099186       NaN
c        NaN       NaN       NaN  0.848987
d        NaN       NaN  0.235228       NaN

In [180]:
df.groupby('c1').mean()

     c3        c4
c1
a   5.0  0.383281
b   5.0  0.245330
c   5.0  0.848987
d   5.0  0.235228

In [181]:
df.groupby(['c1', 'c2']).mean()

        c3        c4
c1 c2
a  A   5.0  0.255368
   B   5.0  0.511193
b  A   5.0  0.186916
   B   5.0  0.449887
   C   5.0  0.099186
c  D   5.0  0.848987
d  C   5.0  0.235228

In [182]:
df.groupby(['c1', 'c2']).size()

c1  c2
a   A     1
    B     1
b   A     1
    B     1
    C     1
c   D     1
d   C     1
dtype: int64

In [183]:
for c1, group in df.groupby('c1'):
    print(c1)
    print(group)

a
  c1 c2  c3        c4
0  a  A   5  0.255368
1  a  B   5  0.511193
b
  c1 c2  c3        c4
2  b  B   5  0.449887
3  b  A   5  0.186916
6  b  C   5  0.099186
c
  c1 c2  c3        c4
4  c  D   5  0.848987
d
  c1 c2  c3        c4
5  d  C   5  0.235228

In [184]:
for (c1, c2), group in df.groupby(['c1', 'c2']):
    print((c1,c2))
    print(group)

('a', 'A')
  c1 c2  c3        c4
0  a  A   5  0.255368
('a', 'B')
  c1 c2  c3        c4
1  a  B   5  0.511193
('b', 'A')
  c1 c2  c3        c4
3  b  A   5  0.186916
('b', 'B')
  c1 c2  c3        c4
2  b  B   5  0.449887
('b', 'C')
  c1 c2  c3        c4
6  b  C   5  0.099186
('c', 'D')
  c1 c2  c3        c4
4  c  D   5  0.848987
('d', 'C')
  c1 c2  c3        c4
5  d  C   5  0.235228

In [185]:
df.groupby(['c1', 'c2'])[['c4']].mean()

             c4
c1 c2
a  A   0.255368
   B   0.511193
b  A   0.186916
   B   0.449887
   C   0.099186
c  D   0.848987
d  C   0.235228

In [186]:
df.groupby('c1')['c3'].quantile()

c1
a    5.0
b    5.0
c    5.0
d    5.0
Name: c3, dtype: float64

In [187]:
df.groupby('c1')['c3'].count()

c1
a    2
b    3
c    1
d    1
Name: c3, dtype: int64

In [188]:
df.groupby('c1')['c4'].median()

c1
a    0.383281
b    0.186916
c    0.848987
d    0.235228
Name: c4, dtype: float64

In [189]:
df.groupby('c1')['c4'].std()

c1
a    0.180896
b    0.182502
c         NaN
d         NaN
Name: c4, dtype: float64

In [190]:
df.groupby(['c1', 'c2'])['c4'].agg(['mean', 'min', 'max'])

           mean       min       max
c1 c2
a  A   0.255368  0.255368  0.255368
   B   0.511193  0.511193  0.511193
b  A   0.186916  0.186916  0.186916
   B   0.449887  0.449887  0.449887
   C   0.099186  0.099186  0.099186
c  D   0.848987  0.848987  0.848987
d  C   0.235228  0.235228  0.235228

In [191]:
df.groupby(['c1', 'c2'], as_index=False)['c4'].mean()

  c1 c2        c4
0  a  A  0.255368
1  a  B  0.511193
2  b  A  0.186916
3  b  B  0.449887
4  b  C  0.099186
5  c  D  0.848987
6  d  C  0.235228

In [192]:
df.groupby(['c1', 'c2'], group_keys=False)['c4'].mean()

c1  c2
a   A     0.255368
    B     0.511193
b   A     0.186916
    B     0.449887
    C     0.099186
c   D     0.848987
d   C     0.235228
Name: c4, dtype: float64

In [193]:
def top(df, n=3, column='c1'):
    return df.sort_values(by=column)[-n:]

top(df, n=5)

  c1 c2  c3        c4
2  b  B   5  0.449887
3  b  A   5  0.186916
6  b  C   5  0.099186
4  c  D   5  0.848987
5  d  C   5  0.235228

In [194]:
df.groupby('c1').apply(top)

  c1 c2  c3        c4
0  a  A   5  0.255368
1  a  B   5  0.511193
2  b  B   5  0.449887
3  b  A   5  0.186916
4  c  D   5  0.848987
5  d  C   5  0.235228
6  b  C   5  0.099186

In [195]:
df.pivot_table(['c3', 'c4'],
              index = ['c1'],
              columns = ['c2'])

     c3                       c4
c2    A    B    C    D         A         B         C         D
c1
a   5.0  5.0  NaN  NaN  0.255368  0.511193       NaN       NaN
b   5.0  5.0  5.0  NaN  0.186916  0.449887  0.099186       NaN
c   NaN  NaN  NaN  5.0       NaN       NaN       NaN  0.848987
d   NaN  NaN  5.0  NaN       NaN       NaN  0.235228       NaN

In [ ]:
df.pivot_table(['c3', 'c4'],
              index = ['c1'],
              columns = ['c2'])